[
  {
    "id": "abci",
    "title": "ABCI",
    "body":
      "ABCI is the Application BlockChain Interface that provides a clean interface between a state transition machine on one computer and the mechanics of its replication across multiple computers.",
    "url": ""
  },
  {
    "id": "atom",
    "title": "Atom",
    "body":
      "The Atom is the native staking currency of the Cosmos Hub. Validators use the Atom to stake and secure the zones within Cosmos. The best analogy is that an Atom is like a virtualized ASIC miner.",
    "url": ""
  },
  {
    "id": "bft",
    "title": "BFT",
    "body":
      "BFT stands for Byzantine Fault-Tolerance. Byzantine faults within distributed systems are some of the most difficult to deal with. A Byzantine Fault-Tolerant consensus algorithm simply means that it can guarantee safety for up to a third of Byzantine, or malicious, actors.",
    "url": ""
  },
  {
    "id": "blockchain",
    "title": "Blockchain",
    "body":
      "A blockchain is a continuously growing list of records, called blocks, which are linked and secured using cryptography. Blockchains are deterministic state machines which act as mechanisms to synchronize data derived from a network of decentralized peers.",
    "url": ""
  },
  {
    "id": "cosmos",
    "title": "Cosmos",
    "body":
      "Cosmos is the network of blockchains which form the decentralized internet of tomorrow.",
    "url": ""
  },
  {
    "id": "cosmos-hub",
    "title": "Cosmos Hub",
    "body":
      "The Cosmos Hub is a blockchain, but it's not just any blockchain; it's a custodial blockchain which keeps track of global invariants across other blockchains that are pegged to the hub, ensuring no double-spends across blockchains is possible.",
    "url": ""
  },
  {
    "id": "cosmos-sdk",
    "title": "Cosmo SDK",
    "body":
      "The Cosmos SDK is the bare bones SDK which gives you the framework for your specific blockchain-based application, allowing you to add functionality through plugins.",
    "url": ""
  },
  {
    "id": "cosmos-network",
    "title": "Cosmos Network",
    "body":
      "The Cosmos Nework is a network of blockchains that exchange value with each other via a protocol called IBC.",
    "url": ""
  },
  {
    "id": "cosmos-voyager",
    "title": "Cosmos Voyager",
    "body":
      "The Cosmos Voyager is the UI for users to delegate, stake, engage in governance, etc. with the Cosmos Network.",
    "url": ""
  },
  {
    "id": "delegator",
    "title": "Delegator",
    "body":
      "Delegators are Atom holders that contribute to the security of the network by choosing secure and highly available validators through the process of delegation.",
    "url": ""
  },
  {
    "id": "discrete-logarithm",
    "title": "The Discrete Logarithm Problem",
    "body":
      "This discrete logarithm problem assumes that it is difficult to factor a large integer composed of two or more large prime factors.",
    "url": ""
  },
  {
    "id": "elliptic-curve",
    "title": "Elliptic Curve",
    "body":
      "In elliptic curve cryptography, a huge curve is generated, from which a public-private key-pair is derived. The chance of collision is 1 in several billions.",
    "url": ""
  },
  {
    "id": "ethermint",
    "title": "Ethermint",
    "body":
      "Ethermint is the Ethereum Virtual Machine running on top of Tendermint PoS Consensus, allowing for significantly reduced block times and scalability. It is natively compatible with Cosmos",
    "url": ""
  },
  {
    "id": "finite-field",
    "title": "Finite Field",
    "body": "",
    "url": ""
  },
  {
    "id": "gf-2-255-19",
    "title": "GF(2^255-19)",
    "body": "",
    "url": ""
  },
  {
    "id": "gaia",
    "title": "Gaia",
    "body":
      "Gaia is the preliminary version of the Cosmos Hub. It is used as the testnet which serves to test the features of both Tendermint Core's and Cosmos' software stacks.",
    "url": ""
  },
  {
    "id": "governance",
    "title": "Governance",
    "body":
      "Blockchain governance is a process that allows participants to vote on-chain using their staked tokens.",
    "url": ""
  },
  {
    "id": "hub",
    "title": "Hub",
    "body": "",
    "url": ""
  },
  {
    "id": "ibc",
    "title": "IBC",
    "body":
      "IBC is the interblockchain communication protocol which can be thought of as the TCP/IP for blockchains. It allows fast-finality blockchains to exchange value with each other.",
    "url": ""
  },
  {
    "id": "ibc-packet",
    "title": "IBC packet",
    "body":
      "IBC packets are packets of data which carry messages and fraud proofs from one zone to the hub.",
    "url": ""
  },
  {
    "id": "lotion",
    "title": "Lotion",
    "body":
      "Lotion is the developer toolkit which allows you to build blockchain applications on Tendermint in JavaScript.",
    "url": ""
  },
  {
    "id": "pos",
    "title": "Proof-of-Stake",
    "body":
      "Poof-of-Stake is a method of consensus in which uses the token itself to secure the network, which acts as a sort of virtualized ASIC, instead of using physical hardware to burn through electricity in order to do so.",
    "url": ""
  },
  {
    "id": "pow",
    "title": "Proof-of-Work",
    "body":
      "Proof-of-Work is a method of consensus in which uses hardware to burn through electricity in order to secure a decentralized network and mine blocks which form a blockchain.",
    "url": ""
  },
  {
    "id": "signature",
    "title": "Signature",
    "body": "",
    "url": ""
  },
  {
    "id": "sharding",
    "title": "Sharding",
    "body": "",
    "url": ""
  },
  {
    "id": "stake",
    "title": "Stake",
    "body": "",
    "url": ""
  },
  {
    "id": "tendermint",
    "title": "Tendermint",
    "body":
      "Tendermint is a proposal mechanism and a state replication algorithm optimized for proof of stake. Tendermint is a swappable consensus engine, compatible for any blockchain application.",
    "url": "https://tendermint.com"
  },
  {
    "id": "testnet",
    "title": "Testnet",
    "body": "",
    "url": ""
  },
  {
    "id": "token",
    "title": "Token",
    "body": "",
    "url": ""
  },
  {
    "id": "validator",
    "title": "Validator",
    "body": "",
    "url": ""
  },
  {
    "id": "validator-set",
    "title": "Validator Set",
    "body": "",
    "url": ""
  },
  {
    "id": "zksnark",
    "title": "zkSNARK",
    "body": "",
    "url": ""
  },
  {
    "id": "zone",
    "title": "Zone",
    "body": "A Cosmos Zone is a blockchain spun up within the Cosmos Network.",
    "url": ""
  }
]
